
/*** Build Menu ***/

"Build Results" = "编译结果";

"Hide Build Log Window" = "隐藏编译日志窗口";

/*** Build Window ***/

"%@ - Build Log" = "%@ - 编译日志";

/*** CLEAN ***/

/* Clean Sheet */

"clean title" = "警告";

"clean message" = "将清理所有的编译包和所有编译的布局";

"Clean" = "清理";

"Cleaning..." = "清理中…";


"Clean %@" = "清理 %@";

"Clean Succeeded \t%@" = "清理完成 \t%@";

"Clean Failed \t%@" = "清理失败 \t%@";

"1 error" = "1 个错误";

"%ld errors" = "%ld 个错误";




"Build %@" = "编译 %@";

"Project %@" = "项目 %@";


/* State */

"Building..." = "编译中…";

"Building package..." = "编译安装包中…";

"Building %lu of 1 package..." = "编译 %lu 进安装包里…";

"Building %lu of %lu packages..." = "编译 %lu 进 %lu 安装包里…";

"Build failed" = "编译失败";

"Build Failed \t%@" = "项目编译失败： \t%@";

"Build succeeded" = "编译成功";

"Build Succeeded \t%@" = "项目编译成功： \t%@";

/* User Notification */

"Build Failed" = "编译失败";

"Build Succeeded" = "编译成功";

/* NSFileManager Errors */

"Error removing" = "删除文件系统项时出错！请检查您是否具有删除此项目的相应权限。";

/* Error and progression strings */

"Create package" = "创建安装包";

"Create reference to package" = "创建该安装包的引用文件";

"Import package" = "导入安装包";




"Copy background image" = "复制背景图像";


"Copy conclusion documents" = "复制结束文件";


"Copy extra resources" = "复制额外资源";


"Copy Installer plugins" = "复制安装程序插件";


"Copy introduction documents" = "复制介绍文件";


"Copy license documents" = "复制许可证文件";


"Copy readme documents" = "复制自述文件";


"Create bill of materials" = "创建工程清单";


"Create build folder" = "创建编译文件夹";


"Create distribution script" = "创建 & 分配脚本";


"Create hierarchy of choices" = "创建可供选择的层次结构";


"Create installation and volume requirements" = "创建安装和磁盘卷的要求";


"Create JavaScript code" = "创建 JavaScript 代码";


"Create PackageInfo document" = "创建安装包信息文件";


"Create pax archive" = "创建 pax 档案";


"Create payload" = "创建安装资源文件";


"Create xar archive" = "创建 xar 档案";


"Distribution script and other resources" = "分发脚本和其他资源";


"Incorrect type for file at path '%@'" = "该文件类型不正确： '%@'";


"Incorrect value for object with tag '%@'" = "该标记对象的值不正确： '%@'";

"An absolute path can not be computed from path '%@'" = "无法计算该文件的绝对路径： '%@'";



"License template for \"%@\" can not be found" = "许可证模版： \"%@\" 丢失";


"Missing build data for tag '%@'" = "缺少此编译项目数据的标签： '%@'";




"The location of the package has not been fully defined." = "安装包的位置尚未完全定义！";

"The identifier of the package can not be empty." = "安装包的标识不能为空！";

"The version of the package can not be empty." = "安装包的版本不能为空！";

"The name of the package can not be empty." = "安装包的名称不能为空！";

"The name of the project can not be empty." = "安装包的项目名称不能为空！";


"Missing information for tag '%@'" = "缺少该标签的信息： '%@'";

" because the item could not be found" = " 因为无法找到该项目";

"The existing folder at path '%@' can not be used as a build folder because it's not a writable folder." = "路径上的现有文件夹 \"%@\" 不能用作构建文件夹，因为它不是可写文件夹。";

"%@ returned error code (%d)" = "%1$@ 返回的错误代码 (%2$d)";

": %@" = ": %@";


"No issues" = "没有问题";

"Unknown Error" = "未知错误";

"Not enough memory to perform operation" = "没有足够的内存来执行操作";

"Language (%@) not supported" = "语言包： (%@) 暂不支持";


"Scripts payload" = "脚本写入安装资源";

"Assemble payload files" = "整合安装资源文件";

"Split forks" = "拆分分支";


"Insufficient privileges to set accounts for path '%@'" = "设置此文件的账户权限不足： '%@'";

"Insufficient privileges to set permissions for path '%@'" = "设置此文件的请求内容不足： '%@'";

"Insufficient privileges to write at path '%@'" = "在此路径上写入的权限不足： '%@'";


"Unable to set attributes of item at path '%@'" = "无法在此路径中设置项目的属性： '%@'";

"Unable to read attributes of item at path '%@'" = "无法读取此路径中项目的属性： '%@'";


"String can not be empty for tag '%@'" = "该 String 的字符串不能为空： '%@'";



"Unable to copy item at path '%@'" = "无法复制此路径中的项目： '%@'";

	/* item type */

"the file" = "文件";

"the folder" = "文件夹";

"the plugin" = "插件";

"the tool" = "工具";

"the package" = "安装包";

"the bundle" = "捆绑包";


"Unable to create %@ at path '%@'" = "无法在 '%@' 创建 %@";

"Unable to delete %@ at path '%@'" = "无法在 '%@' 删除 %@";

"Unable to find %@ at path '%@'" = "无法在 '%@ 查找 %@";


"Unable to find tool '%@'" = "无法找到工具 '%@'";

" because the disk is read only" = " 因为磁盘是只读权限";

" because there's no space left on disk" = " 因为磁盘上没有空间";

" because you don't have permission to create it inside the folder \'%@\'" = " 因为您没有权限在文件夹中创建它 \'%@\'";

" because you don't have permission to access it" = " 因为您无权访问它";

	/* Requirements and Locators errors */

"Converter not found for requirement of type '%@'" = "找不到该类型要求的转换器： '%@'";

"No code generated for requirement '%@'" = "没有为该需求生成代码： '%@'";

"Converter not found for locator of type '%@'" = "找不到该类型定位器的转换器： '%@'";

"No code generated for locator '%@'" = "没有为该定位器生成代码： '%@'";


" because the parameter %@ is missing" = " 因为缺少 %@ 的文件参数";

" because the parameter %@ is invalid" = " 因为 %@ 的参数是无效的";

" because available memory is too low" = " 因为可用内存过低";

/* Signing errors */

"Unable to sign the data (%d)" = "无法签署该数据： (%d)";

"Signing operation timed out" = "签名操作超时";

"Signing operation denied" = "签名操作被拒绝";

"Unable to find signing certificate" = "无法找到签名证书";

"Unable to find keychain" = "无法找到签名文件的钥匙扣";

"Unable to find the private key for the Developer ID Installer certificate" = "无法找到此开发者账号的安装证书的私钥";

"The Developer ID Installer certificate is expired." = "用于此项目的开发者 ID 安装程序证书已过期。";

"The Developer ID Installer certificate is not trusted." = "用于此项目的开发者 ID 安装程序证书不受信任。";
